{
    "genuses": [
        {
            "name": "Viola",
            "occurenceTotalGenus": 3,
            "subgenena": [
                {
                    "name": "Viola palustris",
                    "occurrences": 63,
                    "imgUrl": "http://data.huh.harvard.edu/03862730-a24c-4ab3-86a4-687c2a438c11/image",
                    "description": "## Viola palustris: The Marsh Violet\n\n*Viola palustris*, commonly known as the marsh violet, is a small, perennial flowering plant belonging to the *Violaceae* family.  It's a charming wildflower found in damp, wet habitats across Europe, Asia, and North America, thriving in boggy areas, marshes, wet meadows, and alongside streams.\n\n**Basic Features:**\n\n* **Size:**  A small plant, typically reaching only 5-15 cm (2-6 inches) in height.\n* **Leaves:**  Kidney-shaped or rounded leaves with heart-shaped bases, growing on long stalks.  The leaves are often slightly succulent and have a smooth, somewhat leathery texture.\n* **Flowers:**  The delicate, pale lilac to white flowers are a key characteristic.  They have five petals, the lower petal often displaying darker purple veins.  They're smaller than many other violet species, but similarly possess a characteristic spur at the back.  Blooming typically occurs from April to July.\n* **Fruit:**  After flowering, the plant produces a small, hairy capsule containing numerous tiny seeds.\n\n**Historic Usage:**\n\nWhile not as widely utilized as some other Viola species, *Viola palustris* has seen some traditional uses:\n\n* **Medicinal:**  Historically, like many violets, it was used in folk medicine for its purported soothing properties.  Its application involved the use of the whole plant in poultices or infusions, mainly for treating skin ailments.  However, scientific evidence supporting these uses is lacking and it's crucial not to rely on such traditional applications without professional medical advice.\n* **Ornamental:** Its delicate beauty makes it a sought-after addition to bog gardens or other damp areas in naturalistic landscaping.\n\n\nIt's important to note that while *Viola palustris* is a relatively unassuming plant compared to its more prominent relatives, its adaptation to wet environments and its charming appearance make it a significant part of wetland ecosystems.  Its traditional uses should be viewed within the context of historical practices and not as a recommendation for modern self-medication.\n"
                },
                {
                    "name": "Viola sororia",
                    "occurrences": 91,
                    "imgUrl": "http://data.huh.harvard.edu/5d31e9ad-3cd6-4fc4-ab5f-226c75b9b184/image",
                    "description": "*Viola sororia*, commonly known as the **woolly blue violet**, is a rhizomatous perennial herb belonging to the Violaceae family.  It's a native North American species found in moist woods, meadows, and lawns across much of eastern and central North America.\n\n**Basic Features:**\n\n* **Leaves:**  Heart-shaped to kidney-shaped,  with rounded teeth along the edges.  They are typically 2-7 cm long, borne on long petioles (leaf stalks).  The leaves often exhibit a slightly hairy or woolly texture on the underside, hence the common name.\n* **Flowers:**  Showy, typically violet-blue, though variations exist, including white and pale lavender forms.  The flowers are zygomorphic (bilaterally symmetrical), with five petals:  four spreading upwards and one lower petal, often with darker purple veining which acts as a nectar guide for pollinators.  They bloom primarily in spring.\n* **Fruits:**  The plant produces a capsule-shaped fruit containing numerous small seeds.  These seeds are often dispersed by ants (myrmecochory).\n* **Rhizomes:**  *V. sororia* spreads via underground rhizomes, forming colonies.\n\n**Historic Usage:**\n\nWhile not as widely used medicinally as some other violet species, *Viola sororia* has a history of folk medicinal applications by Indigenous peoples of North America:\n\n* **Wound healing:** The leaves were sometimes applied topically to wounds and sores, possibly due to anti-inflammatory or antimicrobial properties.\n* **Skin ailments:**  Some tribes used the plant to treat various skin conditions.\n* **Expectorant:**  The plant's leaves may have been used in herbal teas to help with respiratory issues.\n\nIt's crucial to note that these traditional uses are based on anecdotal evidence and should not be considered medical advice.  The safety and efficacy of *V. sororia* for medicinal purposes haven't been rigorously studied through modern scientific methods.  Today, it's more often appreciated for its ornamental value in gardens, valued for its early spring blooms and low-maintenance nature.  It readily self-seeds and can be somewhat invasive in ideal conditions.\n"
                },
                {
                    "name": "Viola canadensis",
                    "occurrences": 76,
                    "imgUrl": "http://data.huh.harvard.edu/97256b1b-c0da-4a4d-9de9-1df269c78767/image",
                    "description": "*Viola canadensis*, commonly known as Canada violet, is a perennial herbaceous flowering plant belonging to the Violaceae family.  It's native to eastern North America, ranging from Newfoundland and Quebec south to Georgia and west to Minnesota and Arkansas.\n\n**Basic Features:**\n\n* **Size and Habit:**  Canada violet is relatively small, typically growing 10-25 cm (4-10 inches) tall.  It forms spreading mats from its rhizomes (underground stems).\n* **Leaves:**  The leaves are heart-shaped to kidney-shaped (reniform), with rounded teeth along the edges.  They are dark green, somewhat shiny, and have long petioles (leaf stalks).\n* **Flowers:**  The most striking feature is its delicate flowers, which are typically white to pale lavender, with darker purple veins.  They have five petals, the lower petal often exhibiting a slight spur (a nectar-containing extension at the base).  Flowers are borne singly on slender stalks.\n* **Fruit:**  The plant produces a capsule containing numerous small seeds.\n\n**Historic Usage:**\n\nHistorically, various *Viola* species, including *Viola canadensis*, have been used by Indigenous peoples in North America for a variety of medicinal purposes.  While specific documented uses for *V. canadensis* are less abundant than for some other violet species, it's believed to have been utilized similarly for:\n\n* **Wound Healing:**  Possibly applied topically to minor wounds to promote healing.  This use is based on general properties associated with other violets.\n* **Skin Ailments:**  Potentially used to treat skin irritations or rashes. Again, this is inferred from broader violet applications.\n* **Cough and Cold Relief:**  Some *Viola* species have been used as demulcents (soothing agents) for coughs and colds, and it's possible *V. canadensis* served a similar function.\n\nIt's crucial to note that these historical uses are often based on ethnobotanical accounts and traditional knowledge. Scientific evidence supporting the efficacy of these applications is generally lacking, and self-medication with wild plants should be avoided unless under the guidance of a qualified herbalist or medical professional.  The plant should not be ingested without expert knowledge.  The primary modern use of *Viola canadensis* is ornamental, due to its beautiful flowers and ease of cultivation in shaded gardens.\n"
                }
            ]
        },
        {
            "name": "Salix",
            "occurenceTotalGenus": 3,
            "subgenena": [
                {
                    "name": "Salix bebbiana",
                    "occurrences": 26,
                    "imgUrl": "http://data.huh.harvard.edu/c9e1850c-6fb9-4bd5-aa86-76708d50593b/image",
                    "description": "## Salix bebbiana: The Beaked Willow\n\n*Salix bebbiana*, commonly known as the beaked willow or gray willow, is a deciduous shrub or small tree belonging to the Salicaceae family (willow family).  It's native to North America, ranging across a vast territory from Alaska and Canada south to the northern United States.\n\n**Basic Features:**\n\n* **Size and Form:** Typically grows as a multi-stemmed shrub reaching heights of 1-6 meters (3-20 feet), though it can sometimes develop into a small tree up to 10 meters (33 feet) tall.  It has a somewhat spreading, irregular crown.\n* **Leaves:**  Alternate, oblong-lanceolate to ovate-lanceolate, 5-12 cm long.  The leaves are finely serrated, grayish-green on the upper surface and paler, often silvery-hairy underneath, particularly when young.  The characteristic \"beaked\" tip gives the species its common name.\n* **Bark:**  Young stems are reddish-brown and hairy, becoming dark grayish-brown and rough with age.  Older bark often develops deep fissures.\n* **Flowers:**  Catkins appear in early spring before the leaves, with male and female catkins on separate plants (dioecious). Male catkins are yellowish and more robust than the female catkins, which are greenish.\n* **Fruit:**  The female catkins develop into capsules containing numerous small seeds with long silky hairs that aid in wind dispersal.\n\n**Historic Usage:**\n\nIndigenous peoples of North America have a long history of utilizing *Salix bebbiana* for various purposes:\n\n* **Medicinal:** The bark, rich in salicylic acid (a precursor to aspirin), was widely used as a pain reliever, particularly for headaches and fevers.  It was also employed to treat wounds, rheumatism, and other ailments.  Decoctions and infusions were common methods of preparation.\n* **Basketry and other Crafts:**  The pliable stems were woven into baskets, mats, and other useful items.  The flexible nature of the younger stems made them ideal for crafting.\n* **Construction:** In some regions, the wood, though not exceptionally strong, was used for less demanding construction purposes, such as temporary shelters or fencing.\n\n\n**Important Note:** While historically used medicinally, it's crucial to consult with a healthcare professional before using any part of *Salix bebbiana* for medicinal purposes.  Modern pharmaceuticals provide safer and more standardized forms of salicylic acid.\n"
                },
                {
                    "name": "Salix atrocinerea",
                    "occurrences": 28,
                    "imgUrl": "http://data.huh.harvard.edu/542e7a31-c035-4792-8111-af4a086dda08/image",
                    "description": "*Salix atrocinerea*, commonly known as the grey willow or dark grey willow, is a species of willow native to Western Europe.  It's a large shrub or small tree, typically reaching heights of 3-10 meters (10-33 feet), though occasionally reaching up to 15 meters (49 feet).  It's readily identifiable by its distinctive features:\n\n**Basic Features:**\n\n* **Leaves:**  Elliptical to oblong-lanceolate, 5-15cm long, dark grey-green above and whitish and densely hairy (tomentose) underneath.  The leaf margins are finely serrated.  Young shoots are also densely hairy.\n* **Bark:**  Grey-brown, becoming rough and fissured with age.  Older stems often develop a distinctive dark grey or almost black appearance, lending to the common name \"dark grey willow.\"\n* **Catkins:**  Appear before the leaves in early spring.  They are cylindrical, 3-6cm long, and silvery-grey to yellowish in colour.  Both male and female catkins are found on separate trees (dioecious).\n* **Habit:**  Generally forms a multi-stemmed shrub, though it can develop into a small tree with a short trunk.  It readily spreads by suckers, forming dense thickets.\n\n**Historic Usage:**\n\n* **Basketry:**  Like many willows, *Salix atrocinerea* has historically been a valuable source of pliable stems for basket weaving. The long, slender shoots are easily peeled and woven.\n* **Traditional Medicine:**  Historically, extracts from the bark and leaves were used in traditional medicine for various ailments, primarily as an anti-inflammatory and pain reliever.  However, its medicinal use is largely superseded by modern pharmaceuticals.  It contains salicylic acid, a precursor to aspirin.\n* **Land Stabilization:**  Its ability to readily spread via suckers and tolerate wet conditions has made it useful for stabilizing riverbanks and other erosion-prone areas.\n\n\nIt's important to note that while some traditional uses exist,  it is crucial to **avoid self-medicating** with *Salix atrocinerea*.  The efficacy and safety of traditional remedies haven't undergone the same rigorous testing as modern medicines.  If you have any health concerns, consult a qualified medical professional.\n"
                },
                {
                    "name": "Salix eriocephala",
                    "occurrences": 40,
                    "imgUrl": "http://data.huh.harvard.edu/1d187fe3-b7ec-4713-9497-c70682e6bfaa/image",
                    "description": "## Salix eriocephala: The Missouri River Willow\n\n*Salix eriocephala*, commonly known as the Missouri River willow, is a deciduous shrub or small tree belonging to the willow family (Salicaceae).  It's native to the central United States, primarily found along riverbanks and floodplains, particularly those of the Missouri River system.  It's well-adapted to wet, fertile soils and often forms dense thickets.\n\n**Basic Features:**\n\n* **Size:** Typically grows 10-20 feet tall, but can occasionally reach heights of up to 30 feet.  It usually has a multi-stemmed, bushy structure rather than a single trunk.\n* **Leaves:**  Elliptical to lanceolate leaves, 2-6 inches long, are distinctly silvery-hairy (pubescent) when young, giving the plant its specific epithet \"eriocephala\" (meaning woolly-headed). The hairs often diminish with age, leaving the leaves somewhat leathery and dark green on the upper surface and paler underneath.\n* **Flowers:**  Like all willows, it is dioecious, meaning individual plants bear either male or female flowers (catkins).  The catkins appear in early spring before the leaves emerge. The male catkins are yellow-green, while the female catkins are greenish and become hairy as they develop.\n* **Bark:** The bark is grayish-brown, becoming fissured with age.\n* **Roots:** It has an extensive root system, ideal for stabilizing riverbanks and preventing erosion.\n\n**Historic Usage:**\n\nHistorically, the Missouri River willow, like many willow species, held importance for several Native American tribes.  Its pliable branches were used extensively in basketry and for various crafting purposes, including making arrow shafts and fish traps. The inner bark (cambium) is known to have been utilized as a food source, particularly during times of scarcity, though its nutritional value was likely supplemental.  Its medicinal properties were likely also known but are not extensively documented in the literature. The use of willow species for pain relief due to salicylic acid (a precursor to aspirin) is well-documented elsewhere, suggesting similar properties are likely present here.  Modern uses primarily focus on its ecological value in riparian restoration and erosion control.  Because it is a readily available and quick-growing species, it serves as a valuable tool for land reclamation and habitat creation in disturbed areas.\n"
                }
            ]
        },
        {
            "name": "Galium",
            "occurenceTotalGenus": 3,
            "subgenena": [
                {
                    "name": "Galium asprellum",
                    "occurrences": 14,
                    "imgUrl": "http://data.huh.harvard.edu/43cff700-98bc-4b02-98d3-56a144921ae1/image",
                    "description": "*Galium asprellum*, commonly known as rough bedstraw or rough-leaved bedstraw, is a herbaceous perennial plant belonging to the Rubiaeae tribe within the coffee family, Rubiaeae.  It's native to North America, found in various habitats including moist woodlands, stream banks, and meadows, often preferring shaded, damp conditions.\n\n**Basic Features:**  *Galium asprellum* is characterized by its square stems, which are covered with backward-pointing hairs, giving it a rough texture to the touch – hence the common name \"rough bedstraw.\" Its leaves are typically arranged in whorls of six to eight, narrow and lance-shaped, with prominent veins. The small, white or greenish-white flowers are clustered in loose, terminal cymes (flat-topped or slightly rounded flower clusters).  The fruit is a small, dry, twin-drupe (a fruit with two parts).\n\n**Historic Usage:**  While not as widely documented as some other *Galium* species, *Galium asprellum* has a limited history of traditional use by Native Americans.  Some accounts suggest it was used as a mild astringent and possibly for medicinal purposes, though detailed information on specific applications is scarce and requires further research to confirm.  Its use was likely localized and more anecdotal than widespread.  The plant doesn't have a significant history of use in wider herbal traditions in comparison to species like *Galium aparine* (cleavers).\n\n\n**Important Note:**  While some traditional uses are mentioned, it is crucial to remember that *Galium asprellum* should not be consumed or used medicinally without proper guidance from a qualified herbalist or healthcare professional.  The safety and efficacy of any traditional uses have not been scientifically validated.\n"
                },
                {
                    "name": "Galium lanceolatum",
                    "occurrences": 68,
                    "imgUrl": "http://data.huh.harvard.edu/46d2c20f-de6a-44e9-a4f6-8c20d876ba60/image",
                    "description": "*Galium lanceolatum*, commonly known as lance-leaved bedstraw or slender bedstraw, is a flowering herbaceous perennial plant belonging to the Rubiaeae tribe within the coffee family (Rubiaceae).  It's characterized by its slender, erect stems that typically grow to heights of 15-60cm (6-24 inches).  Its leaves are a key identifying feature: they are linear to narrowly lanceolate (hence the name),  arranged in whorls of four to six around the stem, and are typically 1-4cm long and relatively narrow.  The leaves are usually smooth-edged though sometimes slightly rough.  The small, white, four-petaled flowers are borne in loose, terminal panicles or cymes, flowering from late spring to summer.  The fruit is a small, dry, double-seeded capsule.\n\nHistorically, *Galium lanceolatum*, like many other bedstraws, has seen limited traditional uses. While not as prominently featured in historical texts as some other *Galium* species (such as *Galium verum*, used for cheese-making),  some indigenous groups may have employed it for minor medicinal purposes, though specific details are often scant and require further ethnobotanical research.  Its relatively weak fibers prevented widespread use for textiles, unlike some other bedstraw species.  Some anecdotal evidence suggests its use as a mild astringent or in poultices, but these applications need further scientific validation.\n\nIn summary, *Galium lanceolatum* is a relatively unassuming but easily identifiable member of the bedstraw family. Its distinctive lance-shaped leaves, whorled leaf arrangement, and small white flowers set it apart. While its historical use remains under-documented compared to some relatives, its role in local ecosystems and potential for further study makes it a plant of continued interest.\n"
                },
                {
                    "name": "Galium mollugo",
                    "occurrences": 77,
                    "imgUrl": "http://data.huh.harvard.edu/bac385e8-986f-4ef6-a8b1-35c9deb209dd/image",
                    "description": "Galium mollugo, commonly known as hedge bedstraw or wild madder, is a flowering herbaceous perennial plant belonging to the Rubiaeae tribe within the coffee family, Rubiaceae.  It's characterized by its sprawling, somewhat weak stems that can reach lengths of up to 1 meter, often trailing across the ground or climbing over other vegetation.  The leaves are arranged in whorls of six to eight, narrow and lanceolate (lance-shaped), with a slightly rough texture.  Small, star-shaped white flowers, borne in loose clusters, appear from late spring to summer. These flowers eventually give way to small, round, dry fruits.\n\nHistorically, *Galium mollugo* has held a variety of uses, though many are now largely obsolete.  Its stems, being fibrous, were once used in the making of rough fabrics and rope.  Some historical records suggest its use as a cheese rennet, similar to other bedstraw species, although its efficacy is debated and not widely practiced today.  The plant also has a history of being used in traditional medicine, though scientific evidence supporting any significant medicinal properties remains limited.  These traditional uses often involved employing the plant for its purported diuretic or wound-healing properties.\n\nIn summary, *Galium mollugo* is a readily identifiable plant due to its whorled leaves, white star-shaped flowers, and sprawling habit. Its historical importance lies primarily in its use for rudimentary textile production and some tentative, less-verified medicinal applications.  Today, it's more commonly encountered as a widespread weed in various habitats, including meadows, fields, and waste areas.\n"
                }
            ]
        },
        {
            "name": "Equisetum",
            "occurenceTotalGenus": 3,
            "subgenena": [
                {
                    "name": "Equisetum scirpoides",
                    "occurrences": 26,
                    "imgUrl": "http://data.huh.harvard.edu/7cc688e2-7986-443d-9316-e92424eb188e/image",
                    "description": "*Equisetum scirpoides*, commonly known as **dwarf scouring rush**, is a small, herbaceous plant belonging to the Equisetaceae family, the only extant family in the order Equisetales.  Unlike its larger relatives, it's a relatively unassuming species.\n\n**Basic Features:**\n\n* **Size and Habit:**  *E. scirpoides* is a diminutive horsetail, typically reaching only 10-30 cm (4-12 inches) in height. It forms small, dense clumps rather than sprawling colonies.  Its stems are slender, unbranched, and bright green, lacking the prominent jointed structure characteristic of some larger *Equisetum* species.  They are generally smooth or slightly rough.\n\n* **Leaves:** The leaves are reduced to small, scale-like sheaths around the stem nodes.  These sheaths are dark-brown to black and tooth-like.\n\n* **Reproduction:**  Reproduction occurs both sexually via spores produced in terminal cones (strobili) and asexually through rhizomes, allowing the plant to spread slowly.  The strobili are small and inconspicuous.\n\n**Historic Usage:**\n\nThe historical use of *E. scirpoides* is less extensive than that of its larger, more robust relatives like *Equisetum arvense* (field horsetail).  While it contains silica, like all horsetails, its small size likely limited its application in traditional uses.  Historically, various *Equisetum* species, including potentially *E. scirpoides* in some regions, were used:\n\n* **Abrasive:** The high silica content of the stems made them useful for polishing wood or metal, though the dwarf size would have made it less efficient compared to larger species.\n* **Medicinal:** Some traditional uses included wound healing or diuretic applications, though scientific evidence supporting these uses is lacking and using any *Equisetum* species medicinally requires caution due to potential toxicity.\n\n**In Summary:** *Equisetum scirpoides* is a small, unbranched, and relatively inconspicuous horsetail species.  While sharing the silica-rich stems characteristic of its genus, its diminutive size meant it played a less significant role in historical human uses compared to larger *Equisetum* species.  Its primary significance lies in its ecological role as part of various wetland and damp habitat communities.\n"
                },
                {
                    "name": "Equisetum fluviatile",
                    "occurrences": 77,
                    "imgUrl": "http://data.huh.harvard.edu/289e1186-7435-4202-9a64-2d884a35f4b3/image",
                    "description": "*Equisetum fluviatile*, commonly known as **water horsetail** or **common water horsetail**, is a perennial herbaceous plant belonging to the Equisetaceae family, the only surviving family of the once-diverse Equisetales order.  Unlike its extinct relatives, which included tree-sized forms, *E. fluviatile* is a relatively low-growing plant, typically reaching heights of 30-100cm (1-3 feet).\n\n**Basic Features:**\n\n* **Rhizomatous:** It spreads through extensive underground rhizomes, allowing for rapid colonization of wet habitats.  \n* **Jointed Stems:**  Its distinctive stems are hollow, segmented, and ribbed, with whorls of small, scale-like leaves at each node.  These leaves are reduced and non-photosynthetic, with the stems taking on the primary role of photosynthesis.\n* **Branching:**  While some horsetails are highly branched, *E. fluviatile* is usually unbranched or only sparsely branched, particularly near the base.\n* **Spores:** Reproduction is achieved via spores produced in cone-like structures (strobili) at the tips of some stems. These strobili are relatively short and blunt compared to other *Equisetum* species.\n\n**Historic Usage:**\n\n* **Abrasive:** Historically, the silica-rich stems of *Equisetum fluviatile* (and other species) were used as a natural abrasive for polishing wood and metal.  This is due to the high silica content within the cell walls of the plant.\n* **Medicinal:**  While not widely used today, water horsetail has a history of traditional medicinal applications.  It was used (with varying degrees of success and safety) as a diuretic, astringent, and wound-healing agent.  However, it’s important to note that its use for medicinal purposes requires caution due to potential toxicity related to its thiaminase content (an enzyme that degrades vitamin B1).\n* **Animal Fodder:** Although not a primary food source, it may have been utilized as supplementary fodder for livestock in certain areas, though caution is advised due to the silica content potentially causing digestive issues.\n\n\nIt's crucial to remember that while *Equisetum fluviatile* has historic uses, self-medicating with it is strongly discouraged due to the potential for adverse effects and lack of regulated quality control.  Identification of this plant should only be done by experienced botanists, as it closely resembles other, potentially toxic, species within the *Equisetum* genus.\n"
                },
                {
                    "name": "Equisetum sylvaticum",
                    "occurrences": 24,
                    "imgUrl": "http://data.huh.harvard.edu/4a81cb66-db8a-4fd1-96eb-cbfb1b772d5e/image",
                    "description": "## Equisetum sylvaticum: The Wood Horsetail\n\n*Equisetum sylvaticum*, commonly known as **wood horsetail**, is a perennial herbaceous plant belonging to the Equisetaceae family, the only extant family of the order Equisetales.  It's a fascinating relic from a time when horsetails were far more dominant, reaching tree-like proportions in the Carboniferous period.  Unlike its taller, more robust relatives, *E. sylvaticum* is relatively delicate and branched.\n\n**Basic Features:**\n\n* **Appearance:** This horsetail grows in loose, branched clumps, reaching heights of 20-60 cm (8-24 inches). Its stems are green, jointed, and hollow, with whorls of slender, branching side stems giving it a feathery appearance, particularly noticeable compared to the simpler stems of other Equisetum species.  These side branches are themselves jointed and often droop gracefully.  It lacks the rough, abrasive texture found in some other horsetails.\n* **Reproduction:** It reproduces both sexually through spores produced in terminal cones (strobili) at the tips of its stems, and asexually through rhizomes, spreading underground to form colonies.  The spores are released in large numbers and are dispersed by the wind.\n* **Habitat:** *E. sylvaticum* prefers moist, shady woodland areas, typically found in acidic soils rich in organic matter.  It's common in temperate regions of Europe, Asia, and North America.\n\n**Historic Usage:**\n\nHistorically, *Equisetum sylvaticum* has had several, though now largely superseded, uses:\n\n* **Astringent and Diuretic:**  Like other horsetails, it was traditionally used as a herbal remedy due to its high silica content.  It was believed to possess astringent and diuretic properties, used to treat wounds, kidney ailments, and urinary tract infections.  However, **modern scientific evidence supporting these medicinal claims is limited and inconsistent**, and its use should be approached with caution. Some compounds in horsetails may be toxic if ingested in large quantities.\n* **Polishing Agent:** The abrasive properties of silica in its stems were once utilized as a polishing agent for wood and metal, though this use is largely obsolete.\n* **Food source (with caution):**  Young shoots of some Equisetum species have been eaten as a food source, usually after boiling to reduce toxicity. However, *E. sylvaticum* is generally considered less palatable and less suitable for consumption than other species.\n\n\n**Important Note:** While historically used medicinally, *Equisetum sylvaticum*, like other horsetails, contains thiaminase, an enzyme that can interfere with thiamine (vitamin B1) metabolism.  Therefore, **it should not be consumed regularly or in large quantities without expert advice**.  Always consult a healthcare professional before using any plant for medicinal purposes.\n"
                }
            ]
        },
        {
            "name": "Dryopteris",
            "occurenceTotalGenus": 3,
            "subgenena": [
                {
                    "name": "Dryopteris marginalis",
                    "occurrences": 5,
                    "imgUrl": "http://data.huh.harvard.edu/207a3f4d-f547-461e-81cf-d4d2b0e6bd97/image",
                    "description": "Dryopteris marginalis, commonly known as the marginal wood fern, is a species of fern native to eastern North America, as well as parts of eastern Asia.  It's a hardy, evergreen fern renowned for its adaptability and attractive foliage, making it a popular choice for landscaping.\n\n**Basic Features:**\n\n* **Appearance:**  Marginal wood fern features leathery, lance-shaped fronds (leaves) that are 12-75 cm long and 5-15 cm wide. These fronds are pinnately compound, meaning they are divided into smaller leaflets (pinnae) arranged along a central stalk (rachis).  The characteristic that gives it its name, \"marginal,\" is the placement of its sori (clusters of sporangia containing spores) – they are located along the margins (edges) of the pinnae, not underneath like in many other ferns.  The fronds are a deep, lustrous green and remain attractive throughout the winter in milder climates.\n* **Growth Habit:** It grows in clumps, forming a dense, spreading groundcover. It prefers moist, shady environments but can tolerate some sun, especially in cooler climates.\n* **Hardiness:** It's extremely hardy, typically thriving in USDA plant hardiness zones 3-8.\n\n**Historic Usage:**\n\nHistorically, Dryopteris marginalis held significance among Indigenous peoples of North America.  While specific uses varied regionally, some documented applications include:\n\n* **Medicinal:**  Various parts of the plant, particularly the rhizomes (underground stems), were used in traditional medicine for a range of ailments, possibly including treatment for intestinal parasites and skin conditions.  **It's crucial to note that self-medicating with ferns should be avoided, as some species contain potentially toxic compounds.**  Modern research into the medicinal properties of this specific fern is limited.\n* **Other Uses:**  Like many ferns, it may have been used for thatching or other minor crafting purposes.  \n\nIn more recent times, its primary use is purely ornamental, valued for its beauty and ease of cultivation in gardens and landscaping projects.  Its ability to thrive in shaded areas makes it a valuable addition to woodland gardens and shaded borders.\n"
                },
                {
                    "name": "Dryopteris intermedia",
                    "occurrences": 52,
                    "imgUrl": "http://data.huh.harvard.edu/8377c7c9-da29-4b9c-b09a-5dbb07a695c3/image",
                    "description": "Dryopteris intermedia, commonly known as the intermediate wood fern or the spinulose wood fern, is a species of fern belonging to the Dryopteridaceae family.  It's a robust, deciduous fern native to Europe, Asia, and North America, thriving in moist, shady woodland environments and along streams.\n\n**Basic Features:**\n\n* **Fronds:**  It features broadly lanceolate fronds (leaves), typically 30-100 cm long, that are bipinnate to tripinnate (divided twice or thrice).  The fronds are a medium to dark green, turning brown in the autumn before dying back.  The pinnae (leaflets) are relatively short and broad, with noticeably spinulose (spiny) teeth along their margins, particularly noticeable on the lower pinnae. This spiny characteristic is a key feature distinguishing it from similar ferns. The stipe (stalk) is scaly, especially near the base.\n\n* **Sori:** The sori (clusters of sporangia containing spores) are round and are borne in two rows on the underside of the pinnae. They are typically covered by a kidney-shaped indusium (a protective membrane).\n\n* **Rhizome:** It grows from a creeping rhizome, allowing it to spread gradually to form colonies.\n\n**Historic Usage:**\n\nHistorically, *Dryopteris intermedia*, like other ferns, has seen limited medicinal use.  While not extensively documented,  some traditional practices utilized parts of the plant as a mild vermifuge (expelling intestinal worms), though this application is not supported by modern medicine and should not be attempted without expert guidance.  The plant is primarily known for its ornamental value, appreciated in gardens for its attractive foliage and its ability to thrive in shady conditions.  It has no significant historical economic importance outside of its occasional use in traditional medicine.\n\n**Important Note:**  While traditionally used for medicinal purposes, the safety and efficacy of *Dryopteris intermedia* for treating any condition are not scientifically substantiated.  Ingestion of any part of the plant should be avoided unless under the supervision of a qualified healthcare professional.  Many ferns contain compounds which can be toxic if ingested.\n"
                },
                {
                    "name": "Dryopteris goldieana",
                    "occurrences": 29,
                    "imgUrl": "http://data.huh.harvard.edu/96f4486b-6657-4363-aa8c-406b40da770f/image",
                    "description": "Dryopteris goldieana, commonly known as Goldie's fern or Goldie's wood fern, is a deciduous fern native to eastern North America.  It's a relatively large fern, typically reaching heights of 1 to 1.5 meters (3 to 5 feet), creating a noticeable presence in its woodland habitat.\n\n**Basic Features:**\n\n* **Fronds:**  The fronds (leaves) are broadly lanceolate (lance-shaped) with a distinctly bipinnate-pinnatifid structure.  This means they are twice-divided, with the leaflets further subdivided into smaller lobes.  They are a medium to dark green, turning a yellowish-brown in the fall before dropping. The stipe (the stalk of the frond) is usually noticeably straw-colored, often a pale yellowish-brown, and is relatively smooth compared to some other ferns.\n* **Sori:** The sori (clusters of sporangia containing spores) are round and are located near the midrib on the underside of the pinnae (leaflets). They are initially covered by a kidney-shaped indusium (a protective membrane).\n* **Rhizome:**  Goldie's fern has a creeping rhizome (underground stem), allowing it to spread slowly and form colonies.\n* **Habitat:** It thrives in moist, shady woodlands, often found near streams or in rich, well-drained soils.\n\n\n**Historic Usage:**\n\nHistorically, Goldie's fern, like many other ferns, hasn't had widespread medicinal or practical uses compared to some other plants. Its primary importance has been ecological, contributing to the biodiversity of forest ecosystems.  There is no documented history of extensive human use for food, medicine, or crafting, though some Indigenous peoples may have had limited traditional uses that haven't been widely documented.  Any purported medicinal or other uses should be approached with caution, as research supporting such claims is lacking.  Its primary value today is as an ornamental plant in gardens that mimic its native woodland habitat.\n"
                }
            ]
        },
        {
            "name": "Cyperus",
            "occurenceTotalGenus": 3,
            "subgenena": [
                {
                    "name": "Cyperus strigosus",
                    "occurrences": 65,
                    "imgUrl": "http://data.huh.harvard.edu/8f7b4bbf-ab08-4419-b57f-e13820e8c4bf/image",
                    "description": "## Cyperus strigosus: The Galingale's Humble Cousin\n\n*Cyperus strigosus*, commonly known as **yellow nutsedge**, **water nutsedge**, or **straw-colored flatsedge**, is a persistent, rhizomatous perennial sedge belonging to the Cyperaceae family. Unlike its more flamboyant cousin, the true galingale (*Cyperus longus*), it lacks prominent historical usage as a spice or medicine, though it has played a minor role in traditional practices.\n\n**Basic Features:**\n\n* **Appearance:** Yellow nutsedge forms dense clumps from its extensive, creeping rhizomes (underground stems).  Its stems are triangular in cross-section, a characteristic feature of sedges.  Leaves are linear, grass-like, and typically 3-10 inches long, growing from the base of the stem.  The inflorescence (flower cluster) is an umbel, meaning the flower stalks radiate from a common point, resembling a small, slightly drooping umbrella.  The small, inconspicuous flowers are brownish in color.\n\n* **Habitat:** This sedge thrives in wet, moist soils, making it a common sight in marshes, ditches, along the edges of ponds, lakes, and rivers, and even in poorly drained areas of lawns and fields.  It's highly adaptable and tolerates a wide range of soil conditions, but it prefers full sunlight.\n\n* **Distribution:** *Cyperus strigosus* is widely distributed throughout North America, extending into parts of Central America. It’s considered a native species across much of its range.\n\n**Historical Usage and Cultural Significance:**\n\nWhile lacking the extensive historical use of other *Cyperus* species, *Cyperus strigosus* has seen some limited applications:\n\n* **Indigenous Uses:** Some Native American tribes used parts of the plant for various purposes, though detailed records are scarce.  These uses likely included weaving and possibly some medicinal applications, though specifics are often undocumented or lost to time.  Ethnobotanical research is ongoing and may reveal more about its historical importance.\n\n* **Modern Uses:** Today, it's primarily considered a troublesome weed in lawns and agricultural fields due to its vigorous growth and ability to spread rapidly.  There is little to no commercial cultivation or utilization beyond potential use as a cover crop in wetland restoration projects.\n\n\nIn summary, *Cyperus strigosus* is a common, adaptable sedge with a less prominent historical footprint compared to other members of its genus.  Its significance lies mainly in its ecological role and its status as a tenacious weed, although further research could reveal more about its past and potential future uses.\n"
                },
                {
                    "name": "Cyperus lupulinus",
                    "occurrences": 10,
                    "imgUrl": "http://data.huh.harvard.edu/efbfda40-78c7-45fb-8ecd-ff8856cad96d/image",
                    "description": "*Cyperus lupulinus*, also known as **yellow nutsedge** or **yellow flatsedge**, is a sedge belonging to the Cyperaceae family.  It's a robust, rhizomatous perennial, meaning it spreads aggressively through underground stems (rhizomes) and produces tubers.  These tubers, which are small and brown, are a key distinguishing feature.\n\n**Basic Features:**\n\n* **Leaves:**  Long, flat, grass-like leaves arise from the base, often reaching heights of 30-100 cm (12-40 inches).  They are typically 3-10 mm wide and have a noticeable midrib.\n* **Stems (Culms):**  Triangular in cross-section, smooth, and erect.\n* **Inflorescence:**  The flower heads are composed of numerous spikelets clustered together in a terminal umbel (a branched cluster). The spikelets are yellowish-brown, giving the plant its common name \"yellow nutsedge\".\n* **Fruits (Achenes):** Small, three-angled, hard seeds.\n* **Tubers:**  Small, brown tubers are formed at the tips of rhizomes. These tubers are the primary means of vegetative propagation and contribute to the plant's invasiveness.\n\n\n**Historic Usage:**\n\nThe historical usage of *Cyperus lupulinus* is limited compared to some other cyperus species. While not widely documented as a significant crop or medicinal plant, its tubers were likely consumed in times of scarcity by certain indigenous populations in its native range.  Information about specific historical uses is scarce and often requires further localized ethnobotanical research.  Primarily, its historical impact is largely negative, related to its current status as a problematic weed in agricultural settings.  The plant's aggressive growth makes it a competitor for resources in cultivated fields.\n\n\nIn summary, *Cyperus lupulinus* is a vigorous, spreading sedge easily identified by its yellowish-brown flower heads, triangular stems, and characteristic tubers.  While evidence of extensive historical human use is limited, it is important to note that its impact in agricultural history has primarily been as a troublesome weed.\n"
                },
                {
                    "name": "Cyperus diandrus",
                    "occurrences": 81,
                    "imgUrl": "http://data.huh.harvard.edu/fbe13a79-18de-4e11-ac2f-61c341fafb3b/image",
                    "description": "## Cyperus diandrus: The Two-Stamen Cyperus\n\n*Cyperus diandrus*, commonly known as **two-stamen cyperus**, is a sedge belonging to the Cyperaceae family.  It's a relatively unassuming but widely distributed plant, found in wetlands and along the margins of lakes and rivers across much of North America, Central America, and parts of South America.  \n\n**Basic Features:**\n\n* **Growth Habit:**  *Cyperus diandrus* is an herbaceous perennial, growing in dense clumps from rhizomes (underground stems). It typically reaches heights of 20-100 cm (8-40 inches).\n* **Leaves:**  The leaves are linear, flat, and relatively long, ranging from 10-40 cm (4-16 inches) in length, growing from the base of the plant.  They are usually light green.\n* **Inflorescence:** The plant's distinguishing feature is its inflorescence – a compound umbel (a cluster of smaller umbels radiating from a central point). This umbel typically consists of several rays, each bearing numerous spikelets (small clusters of flowers).  \n* **Flowers:**  The small, inconspicuous flowers are bisexual (having both male and female parts), hence the name \"diandrus\" (meaning \"two-stamened\"), referring to the two prominent stamens per flower.  These flowers are wind-pollinated.\n* **Fruits:** The flowers develop into small, three-angled achenes (dry, one-seeded fruits).\n\n**Historic Usage:**\n\nWhile not widely known for significant historical uses compared to other plants, *Cyperus diandrus* has played a minor role in several cultures:\n\n* **Thatching and Matting:** In some regions, the long, fibrous leaves were traditionally used for weaving mats and rudimentary thatching materials for shelters.  However, this was likely a localized, small-scale practice, not a major industry.\n* **Ethnobotanical Uses:**  Limited evidence suggests potential traditional medicinal applications among certain indigenous groups. However, documented uses are scarce and often lack rigorous scientific backing. Further research is needed to confirm any historical medicinal properties.\n\nIn summary, *Cyperus diandrus* is a common wetland sedge notable for its characteristic inflorescence and its minor historical utilization in crafting and possibly traditional medicine, though the latter requires further investigation.  It's primarily significant ecologically as a component of wetland plant communities.\n"
                }
            ]
        },
        {
            "name": "Persicaria",
            "occurenceTotalGenus": 3,
            "subgenena": [
                {
                    "name": "Persicaria careyi",
                    "occurrences": 73,
                    "imgUrl": "http://data.huh.harvard.edu/934411a8-bfcd-487e-8bfa-cad2e273f6ea/image",
                    "description": "Persicaria careyi, also known as Carey's knotweed or Carey's smartweed, is a herbaceous perennial plant belonging to the Polygonaceae family (buckwheat family).  It's a relatively rare species, primarily found in specific, localized areas of the eastern United States, particularly in the Appalachian Mountains and nearby regions.  \n\n**Basic Features:**\n\n* **Size and Habit:**  It's a relatively small plant, generally growing to heights of 10-60 cm (4-24 inches). It has an erect to ascending growth habit.\n* **Leaves:** The leaves are lanceolate to ovate-lanceolate, meaning they are lance-shaped with a broader base tapering to a point.  They are typically 5-15 cm long and have a slightly hairy texture.  They are alternate along the stem.\n* **Flowers:** The flowers are small and pinkish-white to pale-pink, borne in dense, cylindrical spikes (racemes) at the terminal ends of the stems. These flower spikes are a key identifying feature.  Flowering generally occurs in summer.\n* **Stems:**  The stems are often reddish or purplish, especially at the nodes (where the leaves attach).\n\n**Historic Usage:**\n\nThere's limited documented historical usage of *Persicaria careyi* by Native Americans or early settlers. Unlike some other *Persicaria* species used medicinally,  there's no widespread evidence of its application for food, medicine, or other purposes.  Its rarity may have contributed to this lack of historical record.  Any traditional uses would likely be very localized and undocumented.\n\n\n**Conservation Status:**\n\nDue to its limited range and habitat specificity, *Persicaria careyi* is considered a species of conservation concern in many areas.  Habitat loss and fragmentation are major threats to its survival.\n\n\nIt's important to note that while this description provides basic information, positive identification of *Persicaria careyi* requires careful examination and comparison with other similar *Persicaria* species by a botanist or expert.  Never consume any wild plant unless you have positive identification and knowledge of its edibility by a qualified expert.\n"
                },
                {
                    "name": "Persicaria pensylvanica",
                    "occurrences": 91,
                    "imgUrl": "http://data.huh.harvard.edu/8470791b-1ba3-42f4-81be-f5f4734f511c/image",
                    "description": "Persicaria pensylvanica, commonly known as Pennsylvania smartweed or Pennsylvania knotweed, is an annual herbaceous plant belonging to the Polygonaceae family (buckwheat family).  It's native to North America, readily found in moist to wet soils, often in disturbed areas such as ditches, fields, and along waterways.\n\n**Basic Features:**\n\n* **Size:**  It typically grows to heights of 1 to 3 feet (30-90 cm).\n* **Stems:**  Erect and often branched, with swollen nodes characteristic of many knotweeds.\n* **Leaves:**  Lance-shaped to oblong leaves, usually 2-6 inches long, with a slightly hairy surface. They are alternate and have prominent sheathing stipules (membranous structures encircling the stem at the base of each leaf).\n* **Flowers:**  Small, greenish-white or pinkish flowers are arranged in dense, cylindrical spikes at the ends of the stems and branches.  These spikes are often drooping or nodding. Flowering typically occurs from late summer to autumn.\n* **Fruit:**  Small, three-sided, achenes (dry, single-seeded fruits) develop following flowering.\n\n**Historic Usage:**\n\nThe historical usage of Pennsylvania smartweed is limited compared to some other plants. While not widely documented for extensive medicinal or culinary applications by Indigenous peoples or early European settlers, it was likely used occasionally for minor ailments due to its astringent properties.  Some ethnobotanical sources suggest limited past use as a:\n\n* **Mild astringent:**  The plant's astringent qualities might have been utilized topically for minor skin irritations or wounds.  This is speculative, as specific historical accounts are scarce.\n* **Potential dye source:** Some members of the *Persicaria* genus have yielded dyes, but evidence for this specific species is limited and requires further research.\n\n\nIt's important to note that while some plants in the *Persicaria* genus have documented medicinal uses, there's a lack of sufficient evidence to endorse any specific medicinal use for *Persicaria pensylvanica* without thorough scientific research.  Any potential use should be approached with caution and ideally under the guidance of a healthcare professional or qualified herbalist.  The focus today is primarily on its ecological role as a common plant in North American wetlands and disturbed habitats.\n"
                },
                {
                    "name": "Persicaria punctata",
                    "occurrences": 85,
                    "imgUrl": "http://data.huh.harvard.edu/d97a4b5f-28aa-465d-931a-2b702f273761/image",
                    "description": "Persicaria punctata, also known as spotted knotweed or dotted smartweed, is an annual herbaceous plant belonging to the Polygonaceae (buckwheat) family.  It's characterized by its erect, branching stems that typically reach heights of 1 to 3 feet.  The leaves are lance-shaped to ovate, with a prominent midrib and noticeably dotted with translucent glands, giving it its common name. These glands often appear as tiny, reddish-brown spots on the leaves.  The small, pinkish-white or greenish-white flowers are borne in dense, cylindrical spikes at the ends of the stems and branches. These spikes bloom from summer into autumn. The seeds are small, dark-brown achenes.\n\nHistorically, Persicaria punctata has seen limited widespread medicinal use compared to some other Persicaria species.  However, some indigenous groups have utilized parts of the plant for various purposes.  For instance, poultices made from the leaves were traditionally applied topically to treat skin ailments and wounds.  This practice likely stems from the plant's astringent properties, common in many members of the Polygonaceae family.  However, it's crucial to note that there's limited scientific research validating these traditional uses, and self-medicating with wild plants can be risky.\n\nIn summary, Persicaria punctata is a relatively unassuming but visually distinct weed characterized by its dotted leaves, pinkish-white flower spikes, and a history of limited, localized traditional medicinal use primarily for topical applications.  Its astringent properties might offer some benefit, but further research is needed to confirm any therapeutic value and establish safe usage.\n"
                }
            ]
        }
    ]
}